# =======================================================
# ©️ 2025-26 All Rights Reserved by Purvi Bots (Im-Notcoder) 🚀

# This source code is under MIT License 📜 Unauthorized forking, importing, or using this code without giving proper credit will result in legal action ⚠️
 
# 📩 DM for permission : @TheSigmaCoder
# =======================================================


# MADE BY - ALPHA BABY

class Helper(object):
    HELP_M = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ```
**❖ ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ :-** `/`
'''

    HELP_B = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ```
**❖ ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /**

**❖ ɴᴏᴛᴇ :- ɪꜰ ᴀɴʏ ᴄᴏᴍᴍᴀɴᴅ ᴅᴏᴇs ɴᴏᴛ ᴡᴏʀᴋ, ᴛʏᴘᴇ** `/bug reason` **ɪɴ ʀᴇᴘʟʏ ᴛᴏ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ.**
'''


    HELP_Sona = '''```
❖ ʜєʟᴘ ϻᴧɪη ϻєηυ```
**❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ**

'''

#------------------------------------------------------------------------------------------------------------------------
# TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL | TOOL |
#------------------------------------------------------------------------------------------------------------------------

    HELP_01 = '''```
❖ ᴄʜᴧᴛɢᴘᴛ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴄʜᴧᴛɢᴘᴛ :</u>**

**❖ ᴄʜᴧᴛɢᴘᴛ ᴄσϻϻᴧηᴅs :

❍ /ask : sєᴧʀᴄʜ ᴛʜє ᴧηʏ ᴛʏᴘє ǫυєsᴛɪση.

❖ ɪηѕᴛᴧɢʀᴧϻ ʀєєʟ ᴅᴏᴡηʟᴏᴧᴅ :

❍ /reel : ᴅᴏᴡηʟᴏᴧᴅ ɪηѕᴛᴧɢʀᴧϻ ʀєєʟ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''
    

    HELP_02 = '''```
❖ ᴡʜɪsᴘᴇʀ ❖```
**<u>❖ sᴇɴᴅ ᴡʜɪsᴘᴇʀ ᴍᴇssᴀɢᴇ ❖</u>**

```
ᴜsᴀɢᴇ :- ʙᴏᴛ ᴜsᴇʀɴᴀᴍᴇ | ɪᴅ/ᴜsᴇʀɴᴀᴍᴇ | ᴛᴇxᴛ```


**» єx :-** `@Aaruxmusic_bot @lll_TOXICC_PAPA_lll I love You 😘`


**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''


    HELP_03 = '''```
❖ ɪηꜰσ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ɪηꜰσ :</u>**

**❍ /id : ɢєᴛ ᴛʜє ɢʀσυᴘ/ᴄʜᴀɴɴᴇʟ/ᴜsᴇʀ ɪᴅ.
❍ /info : ɢєᴛ ɪηғσʀϻᴧᴛɪση ᴧʙσυᴛ ᴧ υsєʀ.
❍ /givelink : ɢєᴛ ᴄᴜʀʀєηᴛ ɢʀσᴜᴘ ʟɪηᴋ.
❍ /groupdata : ɢєᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴅᴧᴛᴧ.
❍ /groupinfo : ɢєᴛ ᴀɴʏ ɢʀσᴜᴘ ɪηғᴏ.
❍ /gcstats : ɢєᴛ ʏσᴜʀ ɢʀσᴜᴘ sᴛᴧᴛs.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''
    


    HELP_04 = '''```
❖ ᴛᴧɢ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴛᴧɢ :</u>**

**✿ ᴄʜσσsє ᴛᴧɢ ɪη ʏσυʀ ᴄʜᴧᴛ ✿

❍ /rtag : ʀᴧηᴅσϻ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /rstop : ꜱᴛσᴘ ʀᴧηᴅσϻ ᴛᴧɢ

❍ /vctag : ᴠɪᴅєᴏ ᴄʜᴧᴛ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /vstop : ꜱᴛσᴘ ᴠɪᴅєᴏ ᴄʜᴧᴛ ᴛᴧɢ

❍ /gntag : ηɪɢʜᴛ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /gnstop : ꜱᴛσᴘ ɢη ᴛᴧɢ

❍ /gmtag : ϻσʀηɪηɢ ᴛᴧɢ ꜱᴛᴧʀᴛ
❍ /gmstop : ꜱᴛᴏᴘ ɢϻ ᴛᴧɢ

❍ /utag : ᴜsᴇʀ ᴛᴧɢ sᴛᴀʀᴛ
❍ /atag : ᴀᴅᴍɪɴ ᴛᴀɢ sᴛᴀʀᴛ
❍ /report : ʀᴇᴘᴏʀᴛ ɢʀᴏᴜᴘ ᴀᴅᴍɪɴs
❍ /cancel : ꜱᴛσᴘ ᴧʟʟ ᴛᴧɢ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''


    HELP_05 = '''```
❖ sᴛɪᴄᴋєʀs ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ sᴛɪᴄᴋєʀs :</u>**

**❍ /packkang : ᴄʀєᴧᴛє sᴛɪᴄᴋєʀ ʙʏ σᴛʜєʀ ᴘᴧᴄᴋ.
❍ /stickerid : ɢєᴛ sᴛɪᴄᴋєʀ ɪᴅ σғ sᴛɪᴄᴋєʀ.
❍ /mmf : ʀєᴘʟʏ ᴧηʏ ᴘɪᴄ & ɢɪᴠє ᴛєxᴛ.
❍ /kang : ʀєᴘʟʏ & ᴄʀєᴀᴛє sᴛɪᴄᴋєʀ ᴘᴧᴄᴋ
❍ /st : ғɪηᴅ sᴛɪᴄᴋєʀ ʙʏ ɪᴅ.
❍ /dlsticker : ᴅᴏᴡɴʟᴏᴀᴅ sᴛɪᴄᴋᴇʀ ғɪʟᴇ.
❍ /tiny : ᴄʀᴇᴀᴛᴇ sᴍᴀʟʟ sᴛɪᴄᴋᴇʀ.
❍ /q : ᴄʀєᴧᴛє ϻєssᴧɢє ǫυσᴛє.
❍ /q r : ᴄʀєᴧᴛє ϻєssᴧɢє ǫυσᴛє ᴡɪᴛʜ ʀєᴘʟʏ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''



    HELP_06 = '''```
❖ ᴧᴄᴛɪση```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴧᴄᴛɪση :</u>**

<u>**❖ ʙᴧη ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /ban : ʙᴧηs ᴧ υsєʀ.
❍ /unban : υηʙᴧηs ᴧ υsєʀ**

<u>**❖ ᴋɪᴄᴋs ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /kick : ᴋɪᴄᴋs υsєʀ συᴛ σғ ɢʀσυᴘ.
❍ /kickme : ᴋɪᴄᴋ ᴛᴏ ʏᴏᴜʀsᴇʟғ σғ ɢʀσυᴘ.**

<u>**❖ ᴡᴀʀɴ ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /warn : ɢɪᴠᴇ ᴡᴀʀɴɪɴɢ ᴀ ᴜsᴇʀ
❍ /rmwarn : ʀᴇᴍᴏᴠᴇ ᴡᴀʀɴɪɴɢ ᴀ ᴜsᴇʀ
❍ /warns : ᴄʜᴇᴄᴋ ᴜsᴇʀ ᴡᴀʀɴ ᴄᴏᴜɴᴛs**

<u>**❖ ᴘʀᴏᴍᴏᴛᴇ ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /promote : ᴘʀᴏᴍᴏᴛᴇ ᴀᴅᴍɪɴ ɪɴ ɢʀᴏᴜᴘ
❍ /demote : ᴅᴇᴍᴏᴛᴇ ᴀᴅᴍɪɴ ɪɴ ɢʀᴏᴜᴘ
❍ /fullpromote : ᴘʀᴏᴍᴏᴛᴇ ᴀᴅᴍɪɴ ғᴜʟʟ ʀɪɢʜᴛs**

<u>**❖ ϻυᴛє ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /mute : ᴍᴜᴛᴇ ᴧ υsєʀ.
❍ /tmute : ᴍυᴛє ᴧ υsєʀ ғσʀ ᴛɪϻє.
❍ /unmute : υηϻυᴛєs ᴧ υsєʀ.**

```
ᴛʜɪs ᴄσϻϻᴧηᴅ ᴡɪʟʟ ᴡσʀᴋ σηʟʏ ɪғ ʏσυ ɢɪᴠє ʙᴧη ᴏʀ ɴᴇᴡ ᴀᴅᴍɪɴ ʀɪɢʜᴛs ᴛσ ᴛʜє ʙσᴛ ᴡɪᴛʜ ᴧᴅϻɪη```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''


    HELP_07 = '''```
❖ ɢʀσυᴘ ϻᴧηᴧɢєϻєηᴛ```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ɢʀσυᴘ :</u>**

<u>**❖ ᴘɪη/υηᴘɪη ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /pin : ᴘɪηs ᴧ ϻєssᴧɢє.
❍ /pinned : sᴇᴇ ᴘɪηηєᴅ ϻєssᴧɢє.
❍ /unpin : υηᴘɪη ᴘɪηη ϻєssᴧɢє**

<u>**❖ sᴛᴧғғ/ʙσᴛs ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /staff : ʟɪsᴛ σғ ᴀᴅᴍɪɴs.
❍ /bots : ʟɪsᴛ σғ ʙσᴛs.**

<u>**❖ ɢʀσυᴘ sєᴛ υᴘ ᴄσϻϻᴧηᴅꜱ ❖**</u>

**❍ /settitle : sєᴛ ɴᴀᴍᴇ σғ ɢʀσυᴘ.
❍ /setdis : sєᴛ ʙɪᴏ σғ ɢʀσυᴘ.
❍ /setphoto : sєᴛ ɢʀσυᴘ ᴘʜσᴛσ.
❍ /rmphoto : ʀєϻσᴠє ɢʀσυᴘ ᴘʜσᴛσ.
❍ /unmuteall : ᴜηϻᴜᴛᴇ ᴧʟʟ ϻᴜᴛᴇ ϻєϻʙєʀs.
❍ /unbanall : ᴜηʙᴧη ᴧʟʟ ʙᴧη ϻєϻʙєʀs.
❍ /unpinall : ᴜηᴘɪη ᴧʟʟ ᴘɪη ᴍєssᴧɢᴇ.**

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''



    HELP_08 = '''```
❖ ʜɪsᴛσʀʏ ᴄσϻϻᴧηᴅ ❖```
**<u>❖ ʜєʀє ɪs ʜєʟᴘ ғσʀ ʜɪsᴛᴏʀʏ :</u>**

**❍ /sg : ηᴧϻє & υsєʀηᴧϻє ʜɪsᴛσʀʏ.**

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''



    HELP_09 = '''```
❖ ɢɪᴛʜᴜʙ ᴄσϻϻᴧηᴅꜱ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ɢɪᴛʜᴜʙ :</u>**

**❍ /git : ғɪηᴅ ɢɪᴛʜᴜʙ ᴀᴄᴄᴏᴜɴᴛ.
❍ /allrepo : ᴧʟʟ ʀєᴘᴏ ʙʏ ɢɪᴛ ᴜsєʀηᴧϻє.
❍ /dlrepo : ᴅσᴡηʟσᴧᴅ ᴢɪᴘ ʙʏ ʀєᴘᴏ ᴜʀʟ.**

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''



    
    HELP_10 = '''```
❖ ᴛᴏᴏʟs ❖```
**<u>ʜєʀє ɪs ʜєʟᴘ ғσʀ ᴛᴏᴏʟs:</u>**

**❍ /afk : ᴄʀᴇᴀᴛᴇ ᴀ ᴀғᴋ
❍ /couples : sєє ɢʀσᴜᴘs ᴄσᴜᴘʟєs.
❍ /font : ɢᴇɴ sᴛʏʟɪsʜ ғᴏɴᴛ.
❍ /tts : ᴛєxᴛ ᴛσ ᴠσɪᴄє.
❍ /zombies : ᴄʟᴇᴀɴ ᴅᴇʟᴇᴛᴇ ᴀᴄᴄᴏᴜɴᴛs.
❍ /mongochk : ᴄʜᴇᴀᴄᴋ ᴍᴏɴɢᴏ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
❍ /tgm : ᴍᴇᴅɪᴀ ᴛᴏ ʟɪɴᴋ.
❍ /tr : ᴛʀᴧηꜱʟᴧᴛє ϻυʟᴛɪᴘʟє ʟᴧηɢυᴧɢєs.
❍ /bug :- ʀᴇᴘʟʏ ᴛᴏ ᴍᴇssᴀɢᴇ ғᴏʀ ʙᴜɢ ʀᴇᴘᴏʀᴛ.
❍ /repo :- ɢᴇᴛ ᴛᴇᴀᴍ ᴘᴜʀᴠɪ ʀᴇᴘᴏs.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''


    HELP_11 = '''```
❖ ᴀɴᴛɪ ғʟᴏᴏᴅ ❖```
**<u>❖ ᴧᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs ꜰσʀ ᴀɴᴛɪ ғʟᴏᴏᴅ :</u>**

**❍ /flood : ɢᴇᴛ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴀɴᴛɪғʟᴏᴏᴅ ꜱᴇᴛᴛɪɴɢꜱ

❍ /setflood <number/off/no>: ꜱᴇᴛ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴏғ ᴄᴏɴꜱᴇᴄᴜᴛɪᴠᴇ ᴍᴇꜱꜱᴀɢᴇꜱ ᴛᴏ ᴛʀɪɢɢᴇʀ ᴀɴᴛɪғʟᴏᴏᴅ. ꜱᴇᴛ ᴛᴏ '0', 'ᴏғғ', ᴏʀ 'ɴᴏ' ᴛᴏ ᴅɪꜱᴀʙʟᴇ.

❍ /setfloodtimer <count> <duration>: ꜱᴇᴛ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴏғ ᴍᴇꜱꜱᴀɢᴇꜱ ᴀɴᴅ ᴛɪᴍᴇ ʀᴇQᴜɪʀᴇᴅ ғᴏʀ ᴛɪᴍᴇᴅ ᴀɴᴛɪғʟᴏᴏᴅ ᴛᴏ ᴛᴀᴋᴇ ᴀᴄᴛɪᴏɴ ᴏɴ ᴀ ᴜꜱᴇʀ. ꜱᴇᴛ ᴛᴏ ᴊᴜꜱᴛ 'ᴏғғ' ᴏʀ 'ɴᴏ' ᴛᴏ ᴅɪꜱᴀʙʟᴇ.

❍ /floodmode <action type>: ᴄʜᴏᴏꜱᴇ ᴡʜɪᴄʜ ᴀᴄᴛɪᴏɴ ᴛᴏ ᴛᴀᴋᴇ ᴏɴ ᴀ ᴜꜱᴇʀ ᴡʜᴏ ʜᴀꜱ ʙᴇᴇɴ ғʟᴏᴏᴅɪɴɢ. ᴘᴏꜱꜱɪʙʟᴇ ᴀᴄᴛɪᴏɴꜱ: ban/mute/kick/tban/tmute

❍ /clearflood <yes/no/on/off>: ᴡʜᴇᴛʜᴇʀ ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇꜱ ᴛʜᴀᴛ ᴛʀɪɢɢᴇʀᴇᴅ ᴛʜᴇ ғʟᴏᴏᴅ.


❖ ᴇxᴀᴍᴘʟᴇꜱ :-

ꜱᴇᴛ ᴀɴᴛɪғʟᴏᴏᴅ ᴛᴏ ᴛʀɪɢɢᴇʀ ᴀғᴛᴇʀ 7 ᴍᴇꜱꜱᴀɢᴇꜱ :
-> /setflood 7

ᴅɪꜱᴀʙʟᴇ ᴀɴᴛɪғʟᴏᴏᴅ :
-> /setflood off

ꜱᴇᴛ ᴛɪᴍᴇᴅ ᴀɴᴛɪғʟᴏᴏᴅ ᴛᴏ ᴛʀɪɢɢᴇʀ ᴀғᴛᴇʀ 10 ᴍᴇꜱꜱᴀɢᴇꜱ ɪɴ 30 ꜱᴇᴄᴏɴᴅꜱ :
-> /setfloodtimer 10 30s

ᴅɪꜱᴀʙʟᴇᴅ ᴛɪᴍᴇᴅ ᴀɴᴛɪғʟᴏᴏᴅ :
-> /setfloodtimer off

ꜱᴇᴛ ᴛʜᴇ ᴀɴᴛɪғʟᴏᴏᴅ ᴀᴄᴛɪᴏɴ ᴛᴏ ᴍᴜᴛᴇ :
-> /floodmode mute

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''

    HELP_12 = '''```
❖ ᴀᴘᴘʀᴏᴠᴀʟ ᴍᴏᴅᴇ ❖```
**<u>❖ ᴧᴘᴘʀᴏᴠᴀʟ ᴍᴏᴅᴇ ᴛʜʀᴏᴜɢʜ ʙᴜᴛᴛᴏɴ :</u>**

**❍ ᴡʜᴇɴ ᴜsᴇʀ sᴇɴᴅ ᴊᴏɪɴ ʀᴇǫᴜᴇsᴛ ʙᴏᴛ sᴇɴᴅ ᴜsᴇʀ ɪɴғᴏ ᴡɪᴛʜ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴ ɪɴ ɢʀᴏᴜᴘ** 

```
⋟ ᴏɴʟʏ ᴀᴅᴍɪɴ ᴄᴀɴ ᴀᴘᴘʀᴏᴠᴇ ᴀɴᴅ ᴅɪsᴍɪss ᴀɴᴅ ᴍᴇss ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ɪɴ 10 ᴍɪɴᴜᴛᴇs.```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''

    
    HELP_13 = '''```
❖ ᴘᴜʀɢᴇ ❖```
**<u>❖ ʜєʀє ɪs ʜєʟᴘ ғσʀ ᴘᴜʀɢᴇ :</u>**

**❍ /purge : ᴄʟᴇᴀɴ ɢʀᴏᴜᴘ ᴍᴇssᴀɢᴇs.
❍ /spurge : ᴄʟᴇᴀɴ ɢʀᴏᴜᴘ ᴍsɢ sɪʟᴇɴᴛʟʏ.
❍ /del : ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍsɢ ғᴏʀ ᴅᴇʟᴇᴛᴇ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''

    
    
    HELP_14 = '''```
❖ ᴠᴄ ᴛᴏᴏʟs ❖```
**<u>❖ ʜєʀє ɪs ʜєʟᴘ ғσʀ ᴠᴄ ᴛᴏᴏʟs :</u>**

**❍ /vcstart : sᴛᴀʀᴛ ɢʀᴏᴜᴘ ᴠɪᴅᴇᴏ ᴄʜᴀᴛ.
❍ /vcend : ᴇɴᴅ ɢʀᴏᴜᴘ ᴠɪᴅᴇᴏ ᴄʜᴀᴛ
❍ /vcusers : ᴄʜᴇᴄᴋ ᴄᴜʀʀᴇɴᴛ ᴠᴄ ᴜsᴇʀs ɪɴғᴏ**

```
❖ ɴᴏᴛᴇ : ɪɴ ᴄᴀꜱᴇ ᴛʜᴇ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ᴇɴᴅꜱ, ᴛʜᴇ ʙᴏᴛ ᴍᴜꜱᴛ ʜᴀᴠᴇ ᴛʜᴇ ɴᴇᴡ ᴀᴅᴍɪɴ ʀɪɢʜᴛ.
```

**❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
'''


    HELP_15 = '''```
❖ ᴡᴇʟᴄᴏᴍᴇ ᴄᴏᴍᴍᴀɴᴅs ❖```
**<u>❖ ʜєʀє ɪs ʜєʟᴘ ғσʀ ᴡᴇʟᴄᴏᴍᴇ :</u>**

**❖ ʙᴏᴛ ᴡᴇʟᴄᴏᴍᴇ ʜᴀɴᴅʟᴇ :

❍ /welcome : ɪɴʟɪɴᴇ ᴄᴏɴᴛʀᴏʟs ʙᴜᴛᴛᴏɴ ғᴏʀ ᴡᴇʟᴄᴏᴍᴇ.

❖ ɴɪɢʜᴛ ᴍᴏᴅᴇ ❖

❍ /nightmode : ɪɴʟɪɴᴇ ᴄᴏɴᴛʀᴏʟs ʙᴜᴛᴛᴏɴ ғᴏʀ ɴɪɢʜᴛ ᴍᴏᴅᴇ.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)**
''' 
    
    
    HELP_PROMOTION = '''
**─────────────────────────
ㅤㅤ❖ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση ᴧᴠᴧɪʟᴧʙʟє ❖
─────────────────────────
❍ ᴄʜᴧᴛᴛɪηɢ ɢʀσυᴘ's
❍ ᴄσʟσʀ ᴛʀᴧᴅɪηɢ ɢᴧϻє's
❍ ᴄʜᴧηηєʟ's | ɢʀσυᴘ's .....
❍ ʙєᴛᴛɪηɢ ᴧᴅs σʀ ᴧηʏᴛʜɪηɢ
─────────────────────────
● ᴘʀσϻσᴛє ᴧηʏᴛʜɪηɢ ʏσυ ᴡᴧηᴛ ση συʀ ᴘʟᴧᴛғσʀϻ ᴡɪᴛʜ ʙєsᴛ ᴘʟᴧηs ᴧηᴅ ᴘʀσᴘєʀ sєʀᴠɪᴄєs
─────────────────────────
● ᴅᴧɪʟʏ, ᴡєєᴋʟʏ ᴧηᴅ ϻσηᴛʜʟʏ ᴘʟᴧη'ꜱ ᴧᴠᴧɪʟᴧʙʟє ꜰσʀ ʙɪɢ ʙυꜱɪηєꜱꜱєꜱ ᴧᴛ ᴛʜє ʙєꜱᴛ ᴘσꜱꜱɪʙʟє ᴄσηᴅɪᴛɪσηꜱ !
─────────────────────────
ʙєsᴛ ᴧηᴅ ᴄʜєᴧᴘ ɪη ᴛєʟєɢʀᴧϻ 400-500+ ϻєϻʙєʀs ɪη σηє ᴘʀσϻσᴛɪση ɢυʀᴧηᴛєє...
─────────────────────────
❍ ᴄσηᴛᴧᴄᴛ - [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)
─────────────────────────**
'''
    HELP_ABOUT = '''
**─────────────────────
 ᴡєʟᴄσϻє ᴛσ ˹[ɪꜱʜᴀ ʙᴏᴛs](https://t.me/ISHA_BOTS)˼ sᴛᴧᴛυs
──────────────────────
   ❖ │ ʀєᴧʟ ᴛɪϻє ʙσᴛ's sᴛᴧᴛυs │❖
──────────────────────
╭⎋ [ʏᴏᴜᴛᴜʙᴇ ꭙ ϻυsɪᴄ](https://t.me/ytxmusic_bot) : ᴧʟɪᴠє 
╰⊚ υsᴧɢє : 24 ʜʀs | ᴧssɪsᴛᴧηᴛs : 01
       
╭⎋ [ᴀᴀʀᴜ ꭙ ϻυsɪᴄ](https://t.me/aarumusiccbot) : ᴧʟɪᴠє 
╰⊚ υsᴧɢє : 24 ʜʀs | ᴧssɪsᴛᴧηᴛs : 01

╭⎋ [ʙᴀᴋᴀ ꭙ ᴄʜᴧᴛ](https://t.me/iam_bakkabot) : ᴧʟɪᴠє 
╰⊚ υsᴧɢє : 24 ʜʀs | ᴧssɪsᴛᴧηᴛs : 01
──────────────────────
⊚ ʙσᴛ sᴛᴧᴛυs & ϻσʀє ʙσᴛs - [ᴄʟɪᴄᴋ ʜєʀє](https://t.me/ISHA_BOTS)
──────────────────────
⊚ ʟᴧsᴛ ᴄʜєᴄᴋєᴅ ση  : `19.01.2026`
──────────────────────
❍ 𝐏ᴏᴡєʀєᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐓 ꯭ᴏ ꯭x ꯭ɪ꯭ ᴄ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](https://t.me/lll_TOXICC_PAPA_lll)
──────────────────────**
'''
    HELP_ALLBOT = '''
**─────────────────────
✦ ᴛʜɪs ɪs <u>{0}</u>
──────────────────────
❖ ᴧ ϻᴜsɪᴄ + ϻᴧηᴧɢєϻєηᴛ ʙσᴛ ғσʀ ᴛєʟєɢʀᴧϻ ɢʀσᴜᴘs / ᴄʜᴧηηєʟs.
──────────────────────
● ᴡʀɪᴛᴛєη ɪη » [ᴩʏᴛʜση](https://www.python.org/)
● ᴅᴧᴛᴧʙᴧsє » [ϻᴏηɢᴏ-ᴅʙ](https://www.mongodb.com/)
● ʜєʟᴘ ᴡɪᴛʜ [ᴘʏʀσɢʀᴧϻ](https://github.com/pyrogram/pyrogram) & [ᴘʏ-ᴛɢᴄᴧʟʟs](https://github.com/pytgcalls/pytgcalls).
──────────────────────
● ηᴏ ʟᴀɢ ɪssᴜєs ηᴏ ᴧᴅs ηᴏ ʙᴜɢs.
● sᴜᴘᴘᴏʀᴛ ᴧʟʟ ᴛɪϻє sᴛᴧʏ ᴡɪᴛʜ ᴜs.
──────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ » [ɪꜱʜᴀ-ᴜᴘᴅᴧᴛєs](https://t.me/ISHA_UPDATES)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ » [ɪꜱʜᴀ-sυᴘᴘσʀᴛ](https://t.me/+FZ03qXPymJdlMzdl)
❖ ɢɪᴛ ʜᴜʙ ʟɪηᴋ » [тєᴧϻ-ɪꜱʜᴀ](github.com/TEAM-ISHA)
──────────────────────
➤ ʙσᴛ sᴛᴧᴛυs & ϻσʀє ʙσᴛs - [ᴄʟɪᴄᴋ ʜєʀє](https://t.me/ISHA_BOTS)
➤ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση :- [ᴄσηᴛᴧᴄᴛ ʜєʀє](https://t.me/lll_TOXICC_PAPA_lll)
──────────────────────**

'''

#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------


    
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
    }

    
    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
    }




#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------


# ======================================================
# ©️ 2025-26 All Rights Reserved by Purvi Bots (Im-Notcoder) 😎

# 🧑‍💻 Developer : t.me/TheSigmaCoder
# 🔗 Source link : GitHub.com/Im-Notcoder/Sonali-MusicV2
# 📢 Telegram channel : t.me/Purvi_Bots
# =======================================================
